sograindustries/nrf52_fw/examples/ble_peripheral/ble_app_uart/main.c
static uint32_t   ecg_control            = 0;
static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static uint16_t   m_ble_nus_max_data_len = BLE_GATT_ATT_MTU_DEFAULT - 3;            /**< Maximum length of data (in bytes) that can be transmitted to the peer by the Nordic UART service module. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
    {BLE_UUID_NUS_SERVICE, NUS_SERVICE_UUID_TYPE}
};


const nrf_drv_timer_t TIMER_LED = NRF_DRV_TIMER_INSTANCE(1);

void get_mock_adc(int16_t* data, int length) {
  static int offset = 0;
  for (int ii = 0; ii < length; ii++) {
    data[ii] = mock_data[offset];
    offset++;
    offset %= 1024;
  }
}

void get_ramp(int16_t* data, int length) {
  static int16_t value = 0;
  for(int ii = 0; ii < length; ii++) {
    data[ii] = value++;
  }
}

void get_constant(int16_t* data, int length, int16_t constant) {
  for(int ii = 0; ii < length; ii++) {
    data[ii] = constant;
  }
}

/**
 * @brief Handler for timer events.
 */
void timer_event_handler(nrf_timer_event_t event_type, void* p_context)
{
    static uint8_t data_array[BLE_NUS_MAX_DATA_LEN];
    const uint16_t data_length = 60;
    static uint8_t index = 10;
    uint32_t           err_code;
  static int timer_count = 0;
    switch (event_type)
    {
        case NRF_TIMER_EVENT_COMPARE1:
            timer_count++;
            ble_ecg_status_set(&m_nus, m_conn_handle, timer_count);

            if (ecg_control & 0x1) {
              switch ((ecg_control >> 1) & 0x3) {
                case 0:
                  get_ramp((int16_t*) data_array, data_length/2);
                  break;
                case 1:
                  get_mock_adc((int16_t*) data_array, data_length/2);
                  break;
                default:
                  get_constant((int16_t*) data_array, data_length/2, 1);
                  break;
              }
              ble_nus_data_send(&m_nus, data_array, &data_length, m_conn_handle);
            }
        default:
            //Do nothing.
            break;
    }
}



/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyse
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t * p_file_name)
{
    app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for initializing the timer module.
 */
static void timers_init(void)
{
    ret_code_t err_code = app_timer_init();
    APP_ERROR_CHECK(err_code);
}

/**@brief Function for the GAP initialization.
 *
 * @details This function will set up all the necessary GAP (Generic Access Profile) parameters of
 *          the device. It also sets the permissions and appearance.
 */
static void gap_params_init(void)
{
    uint32_t                err_code;
    ble_gap_conn_params_t   gap_conn_params;
    ble_gap_conn_sec_mode_t sec_mode;

    BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

    err_code = sd_ble_gap_device_name_set(&sec_mode,
                                          (const uint8_t *) DEVICE_NAME,
                                          strlen(DEVICE_NAME));
    APP_ERROR_CHECK(err_code);

    memset(&gap_conn_params, 0, sizeof(gap_conn_params));

    gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
    gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
    gap_conn_params.slave_latency     = SLAVE_LATENCY;
    gap_conn_params.conn_sup_timeout  = CONN_SUP_TIMEOUT;

    err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
    APP_ERROR_CHECK(err_code);
}


/**@brief Function for handling Queued Write Module errors.
 *
 * @details A pointer to this function will be passed to each service which may need to inform the
 *          application about an error.
 *
 * @param[in]   nrf_error   Error code containing information about what went wrong.
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
    APP_ERROR_HANDLER(nrf_error);
}


/**@brief Function for handling the data from the Nordic UART Service.
 *
 * @details This function will process the data received from the Nordic UART BLE Service and send
 *          it to the UART module.
 *
 * @param[in] p_evt       Nordic UART Service event.
 */
/**@snippet [Handling the data received over BLE] */
static void nus_data_handler(ble_nus_evt_t * p_evt)
{

    if (p_evt->type == BLE_NUS_EVT_RX_DATA)
    {
        uint32_t err_code;

        NRF_LOG_DEBUG("Received data from BLE NUS.");
        NRF_LOG_DEBUG("Data Size: %d", p_evt->params.rx_data.length);
        if( p_evt->params.rx_data.length != 4)
          return;

        ecg_control = *((uint32_t*)p_evt->params.rx_data.p_data);
//        NRF_LOG_HEXDUMP_DEBUG(p_evt->params.rx_data.p_data, p_evt->params.rx_data.length);
        ble_ecg_control_set(&m_nus, m_conn_handle, ecg_control);
        NRF_LOG_DEBUG("ecg_control: %d", ecg_control);

    }

}
/**@snippet [Handling the data received over BLE] */


/**@brief Function for initializing services that will be used by the application.
 */
static void services_init(void)
{
    uint32_t           err_code;
    ble_nus_init_t     nus_init;
    nrf_ble_qwr_init_t qwr_init = {0};

    // Initialize Queued Write Module.
    qwr_init.error_handler = nrf_qwr_error_handler;

    err_code = nrf_ble_qwr_init(&m_qwr, &qwr_init);
    APP_ERROR_CHECK(err_code);

    // Initialize NUS.
    memset(&nus_init, 0, sizeof(nus_init));

    nus_init.data_handler = nus_data_handler;

